Revit 2026 API

# RebarSpliceRules Class

---

Describes the rules for splicing Rebar.

SystemObject Autodesk.Revit.DB.StructureRebarSpliceRules

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarSpliceRules : IDisposable
```
```vb
Public Class RebarSpliceRules
	Implements IDisposable
```
```cpp
public ref class RebarSpliceRules : IDisposable
```
```fsharp
type RebarSpliceRules =
    class
        interface IDisposable
    end
```

The RebarSpliceRules type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MaximumBarLength | Identifies the maximum bar length. The default value is 12 meters if the document units are in Metric System, or 40 feet if the units are in Imperial System. |
|  | MinimumBarLength | Identifies the minimum bar length. The default value is 1 meter if the document units are in Metric System, or 3 feet if the units are in Imperial System. |
|  | RunOutPosition | Identifies the run-out position. The default value is RebarSpliceByRulesRunOutPosition.End. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of RebarSpliceRules with the default options. |
|  | Dispose | Releases all resources used by the RebarSpliceRules |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetMaximumAndMinimumBarLength | Sets the maximum and minimum bar length. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace